<div class="order-block">
	<div class="price-wrap gray-block" itemprop="offers" itemscope itemtype="https://schema.org/Offer">
		<?php
		// Если есть розничная цена
		if($price){ 
			include_once(locate_template('catalog-parts/product-hero/body-order-block--price.php'));
		// Если есть оптовая цена
		} elseif($price_opt){ 
			include_once(locate_template('catalog-parts/product-hero/body-order-block--price-opt.php'));
		// Если нет цены
		} else{ ?>
		<div class="button">
			<button data-src="#popup-price" data-fancybox class="btn" anim="ripple"><span>Уточнить цену</span></button>
		</div>
		<?php } ?>
	</div>
	
	<?php if($catalog_pay_variants || $catalog_delivery_variants || $catalog_delivery_free){ ?>
	<div class="detail-wrap">
		
		<?php if($catalog_pay_min){ ?>
		<div class="min-wrap detail-block">
			<div class="icon">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 513 513" xmlns:v="https://vecta.io/nano"><path d="M250 512.5H120c-66.168 0-120-53.832-120-120v-272C0 54.332 53.832.5 120 .5h272c66.168 0 120 53.832 120 120v47c-1.056 26.536-38.953 26.516-40 0v-47c0-44.112-35.888-80-80-80H120c-44.112 0-80 35.888-80 80v272c0 44.112 35.888 80 80 80h130c26.536 1.056 26.516 38.953 0 40zm77-402c0-11.046-8.954-20-20-20H205c-26.536 1.056-26.516 38.953 0 40h102c11.046 0 20-8.954 20-20zm186 171c-3.208-92.786-196.831-92.73-200 .001 0 39.251 43.925 69.999 100 69.999s100-30.748 100-70zm-54.032-18.396c18.557 11.641 18.555 25.151 0 36.791-23.366 15.313-68.571 15.312-91.937 0-18.557-11.641-18.555-25.151 0-36.791 11.8-7.375 28.555-11.604 45.968-11.604s34.169 4.229 45.969 11.604zM412 512.5c-34.4 0-66.978-9.874-91.731-27.802-8.946-6.479-10.945-18.984-4.466-27.93s18.984-10.945 27.929-4.467c37.006 26.803 99.531 26.803 136.537 0 8.945-6.479 21.45-4.479 27.929 4.467s4.479 21.45-4.466 27.93C478.978 502.626 446.4 512.5 412 512.5zm91.731-108.802c8.946-6.479 10.945-18.984 4.466-27.93s-18.984-10.946-27.929-4.467c-37.006 26.803-99.531 26.803-136.537 0-8.945-6.479-21.451-4.479-27.929 4.467s-4.479 21.45 4.466 27.93C345.022 421.626 377.6 431.5 412 431.5s66.978-9.874 91.731-27.802z"/></svg>
			</div>
			<div class="text">
				Минимальный заказ: <span><?php echo $catalog_pay_min; ?></span>
			</div>
		</div>
		<?php } ?>
		
		<?php if($catalog_pay_variants){ ?>
		<div class="pay-wrap detail-block">
			<div class="icon">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" xmlns:v="https://vecta.io/nano"><circle cx="117.3" cy="330.7" r="32"/><path d="M405.3 64H106.7C47.8 64.1.1 111.8 0 170.7v170.7C.1 400.2 47.8 447.9 106.7 448h298.7c58.9-.1 106.6-47.8 106.7-106.7V170.7c-.2-58.9-47.9-106.6-106.8-106.7zm-298.6 42.7h298.7c35.3 0 64 28.7 64 64H42.7c0-35.4 28.6-64 64-64zm298.6 298.6H106.7c-35.3 0-64-28.7-64-64v-128h426.7v128c-.1 35.4-28.7 64-64.1 64z"/></svg>
			</div>
			<div class="text">
				Оплата: <?php echo $catalog_pay_page_link; ?>
				<?php if($catalog_pay_custom){ ?>
				<p><span><?php echo $catalog_pay_custom; ?></span></p>
				<?php } ?>
			</div>
		</div>
		<?php } ?>
		
		<?php if($catalog_delivery_variants){ ?>
		<div class="delivery-wrap detail-block">
			<div class="icon">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" xmlns:v="https://vecta.io/nano"><path d="M105.054 321.244c-35.365 0-64.138 28.768-64.138 64.138s28.774 64.138 64.138 64.138 64.138-28.774 64.138-64.138-28.774-64.138-64.138-64.138zm0 95.107c-17.074 0-30.963-13.889-30.963-30.963s13.889-30.969 30.963-30.969 30.963 13.895 30.963 30.969-13.889 30.963-30.963 30.963zm286.41-95.107c-35.37 0-64.138 28.768-64.138 64.138s28.774 64.138 64.138 64.138 64.138-28.774 64.138-64.138-28.768-64.138-64.138-64.138zm0 95.107c-17.074 0-30.963-13.889-30.963-30.963s13.889-30.969 30.963-30.969 30.969 13.895 30.969 30.969-13.895 30.963-30.969 30.963z"/><path d="M63.032 144.864a16.59 16.59 0 0 0-14.746 8.99L1.841 243.98A16.58 16.58 0 0 0 0 251.577v133.806a16.59 16.59 0 0 0 16.587 16.587H56.95v-33.175H33.175V255.602l39.97-77.563h126.457v-33.175H63.032zm91.231 223.931H343.36v33.175H154.263z"/><path d="M495.413 62.479h-295.81a16.59 16.59 0 0 0-16.587 16.587v306.315h33.175V95.654h262.635v273.14h-39.81v33.175h56.397A16.59 16.59 0 0 0 512 385.382V79.067a16.59 16.59 0 0 0-16.587-16.588z"/><path d="M16.587 235.542h183.015v33.175H16.587zm412.155-71.84a16.58 16.58 0 0 0-23.416-1.382l-82.23 73.04-32.622-33.042c-6.436-6.519-16.941-6.585-23.455-.149a16.6 16.6 0 0 0-.149 23.46l43.675 44.233c3.235 3.279 7.52 4.938 11.81 4.938a16.51 16.51 0 0 0 11.003-4.186l93.996-83.496a16.59 16.59 0 0 0 1.388-23.416z"/></svg>
			</div>
			<div class="text">
				Доставка: <span><?php echo $catalog_delivery_page_link; ?></span>
				<?php if($catalog_delivery_custom){ ?>
				<p><span><?php echo $catalog_delivery_custom; ?></span></p>
				<?php } ?>
			</div>
		</div>
		<?php } ?>
		
		<?php if($catalog_delivery_free){ ?>
		<div class="delivery-wrap detail-block">
			<div class="icon">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 384" xmlns:v="https://vecta.io/nano"><path d="M275.312 140.688a16 16 0 0 0-22.624 0L184 209.368l-28.688-28.68a16 16 0 0 0-22.624 22.624l40 40C175.808 246.44 179.904 248 184 248s8.192-1.56 11.312-4.688l80-80a16 16 0 0 0 0-22.624zM368 176a16.01 16.01 0 0 0-16 16c0 88.224-71.776 160-160 160S32 280.224 32 192 103.776 32 192 32c42.952 0 83.272 16.784 113.544 47.264 6.216 6.28 16.352 6.312 22.624.08a16 16 0 0 0 .08-22.624C291.928 20.144 243.536 0 192 0 86.128 0 0 86.128 0 192s86.128 192 192 192 192-86.128 192-192a16.01 16.01 0 0 0-16-16z"/></svg>
			</div>
			<div class="text">
				Бесплатная доставка
				<span><?php echo $catalog_delivery_free_map ? "по ".$catalog_delivery_free_map : ""; ?></span>
			</div>
		</div>
		<?php } ?>
		
	</div>
	<?php } ?>
	
</div>